Autodesk.Revit.DB.ProjectBrowserTabInfo.GetProjectBrowserTabInfo(Autodesk.Revit.DB.Document)
Gets a ProjectBrowserTabInfo reference.
document:
The document.
Returns:
Instance of ProjectBrowserTabInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo.SetFirstVisibleItemIndex(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ProjectBrowserTabType)
Set the first visible item Index for scrolling
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo.GetFirstVisibleItemIndex(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ProjectBrowserTabType)
Returns the first visible item Index for scrolling
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo.GetVisibleTabTypes(Autodesk.Revit.DB.Document)
get visible tab types
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ProjectBrowserTabInfo.ActiveTabType
get active tab type
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo.#ctor
Since:
2025

Autodesk.Revit.DB.ProjectBrowserTabInfo
A class visit data of ProjectBrowser TabInfo.
Since:
2025